-- phpMyAdmin SQL Dump
-- version 4.4.15.1
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2016 年 2 月 08 日 11:43
-- サーバのバージョン： 5.6.28
-- PHP Version: 5.5.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `basketball`
--

-- --------------------------------------------------------

--
-- テーブルの構造 `match_members`
--

CREATE TABLE IF NOT EXISTS `match_members` (
  `id` int(11) NOT NULL,
  `match_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `cancel_flag` int(11) NOT NULL DEFAULT '0',
  `applied` datetime DEFAULT NULL,
  `cancelled` datetime DEFAULT NULL,
  `master_flag` int(11) DEFAULT '0'
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

--
-- テーブルのデータのダンプ `match_members`
--

INSERT INTO `match_members` (`id`, `match_id`, `user_id`, `cancel_flag`, `applied`, `cancelled`, `master_flag`) VALUES
(2, 1, 1, 1, '2016-02-04 06:59:35', '2016-02-08 20:23:06', 0),
(3, 1, 1, 1, '2016-02-04 07:00:41', '2016-02-08 20:23:06', 0),
(4, 1, 1, 1, '2016-02-04 07:01:13', '2016-02-08 20:23:06', 0),
(5, 1, 1, 1, '2016-02-04 07:07:24', '2016-02-08 20:23:06', 0),
(6, 1, 1, 1, '2016-02-04 07:07:49', '2016-02-08 20:23:06', 0),
(7, 1, 1, 1, '2016-02-04 07:08:13', '2016-02-08 20:23:06', 0),
(8, 1, 1, 1, '2016-02-04 07:08:20', '2016-02-08 20:23:06', 0),
(9, 3, 1, 1, '2016-02-04 07:28:30', '2016-02-04 07:54:24', 0),
(10, 1, 1, 1, '2016-02-04 11:49:29', '2016-02-08 20:23:06', 0),
(11, 1, 1, 1, '2016-02-04 11:54:19', '2016-02-08 20:23:06', 0),
(12, 1, 1, 1, '2016-02-04 12:22:17', '2016-02-08 20:23:06', 0),
(13, 1, 1, 1, '2016-02-04 12:22:24', '2016-02-08 20:23:06', 0),
(14, 1, 1, 1, '2016-02-04 12:22:25', '2016-02-08 20:23:06', 0),
(15, 1, 1, 1, '2016-02-04 12:22:25', '2016-02-08 20:23:06', 0),
(16, 2, 1, 1, '2016-02-04 12:44:58', '2016-02-05 10:30:08', 0),
(17, 2, 1, 1, '2016-02-04 12:45:02', '2016-02-05 10:30:08', 0),
(18, 8, 1, 0, NULL, NULL, 1),
(19, 9, 1, 0, NULL, NULL, 1),
(20, 10, 1, 0, '2016-02-05 03:00:33', NULL, 1),
(21, 2, 1, 1, '2016-02-05 03:10:39', '2016-02-05 10:30:08', 0),
(22, 2, 1, 1, '2016-02-05 03:10:43', '2016-02-05 10:30:08', 0),
(23, 2, 1, 1, '2016-02-05 03:11:49', '2016-02-05 10:30:08', 0),
(24, 2, 1, 1, '2016-02-05 03:11:52', '2016-02-05 10:30:08', 0),
(25, 2, 1, 0, '2016-02-05 10:30:11', NULL, 0),
(26, 3, 1, 0, '2016-02-05 10:32:55', NULL, 0),
(27, 7, 1, 1, '2016-02-05 11:20:32', '2016-02-05 11:34:47', 0),
(28, 7, 1, 1, '2016-02-05 11:31:14', '2016-02-05 11:34:47', 0),
(29, 7, 1, 1, '2016-02-05 11:31:18', '2016-02-05 11:34:47', 0),
(30, 7, 1, 0, '2016-02-05 11:34:49', NULL, 0),
(31, 5, 1, 1, '2016-02-05 11:42:14', '2016-02-05 11:44:34', 0),
(32, 5, 1, 0, '2016-02-05 11:44:55', NULL, 0),
(33, 11, 1, 1, '2016-02-05 11:48:21', '2016-02-08 20:30:39', 1),
(34, 11, 1, 1, '2016-02-05 12:32:04', '2016-02-08 20:30:39', 0),
(35, 11, 1, 1, '2016-02-05 12:33:55', '2016-02-08 20:30:39', 0),
(36, 11, 1, 1, '2016-02-05 12:44:20', '2016-02-08 20:30:39', 0),
(37, 11, 1, 1, '2016-02-06 19:55:08', '2016-02-08 20:30:39', 0),
(38, 12, 1, 0, '2016-02-06 19:59:18', NULL, 1),
(39, 1, 1, 1, '2016-02-07 08:35:59', '2016-02-08 20:23:06', 0),
(40, 1, 1, 0, '2016-02-08 20:23:24', NULL, 0);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `match_members`
--
ALTER TABLE `match_members`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `match_members`
--
ALTER TABLE `match_members`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=41;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
